In [1]:
#importing libraries
import pandas as pd
import numpy as np

In [2]:
#Create a dataframe Replace all the NaN values with Zero's in a column of a dataframe.
d={'name':['kavi','ravi','navi','savi'],'age':[10,12,10,11],'score':[32,np.nan,23,41],'qualify':['yes','yes','no','yes']}
df=pd.DataFrame(d)
df.fillna(0)

   name  age  score qualify
0  kavi   10   32.0     yes
1  ravi   12    0.0     yes
2  navi   10   23.0      no
3  savi   11   41.0     yes

In [3]:
#make a column index
temp=df.set_index('name')
temp

      age  score qualify
name
kavi   10   32.0     yes
ravi   12    NaN     yes
navi   10   23.0      no
savi   11   41.0     yes

In [4]:
#change index to a column
temp.reset_index()

   name  age  score qualify
0  kavi   10   32.0     yes
1  ravi   12    NaN     yes
2  navi   10   23.0      no
3  savi   11   41.0     yes

In [5]:
#count the NaN or missing values in one or more columns in DataFrame.
df.isnull().sum()

name       0
age        0
score      1
qualify    0
dtype: int64

In [6]:
#drop rows with missing values
df.dropna()

   name  age  score qualify
0  kavi   10   32.0     yes
2  navi   10   23.0      no
3  savi   11   41.0     yes

In [7]:
#combining two series into a DataFrame.
s1=pd.Series([23,12,43,15], name='col1')
s2=pd.Series([13,22,47,11], name='col2')

new=pd.concat([s1,s2],axis=1)
new

   col1  col2
0    23    13
1    12    22
2    43    47
3    15    11

In [8]:
#Sort a given DataFrame rows.
df.sort_values(by=['age'])

   name  age  score qualify
0  kavi   10   32.0     yes
2  navi   10   23.0      no
3  savi   11   41.0     yes
1  ravi   12    NaN     yes

In [9]:
#check whether a given column is present in a DataFrame or not.

check='section'

if check in list(df.columns):
    print('column exist')
    
else:
    print('column does not exist')

column does not exist

In [10]:
#get the datatypes of columns of a DataFrame.
df.dtypes

name        object
age          int64
score      float64
qualify     object
dtype: object

In [11]:
#append data to an empty DataFrame.
df1=pd.DataFrame([])
df1.append({'a':1,'b':2}, ignore_index=True)

     a    b
0  1.0  2.0

In [12]:
#sort a given DataFrame by two or more columns.
df.sort_values(by=['name','qualify'])
df

   name  age  score qualify
0  kavi   10   32.0     yes
1  ravi   12    NaN     yes
2  navi   10   23.0      no
3  savi   11   41.0     yes

In [39]:
#convert the datatype of a given column (floats to int)
d={'name':['kavi','ravi','navi','savi'],'age':[10,12,10,11],'score':[32.2,11,23,41],'qualify':['yes','yes','no','yes']}
df=pd.DataFrame(d)
df['score']=df['score'].astype(int)
df.dtypes

name       object
age         int64
score       int32
qualify    object
dtype: object

In [40]:
#insert a given column at a specific column index in a DataFrame.
new_col=['football','cricket','vollyball','cricket']

df.insert(loc=2,column='sports',value=new_col)
df

   name  age     sports  score qualify
0  kavi   10   football     32     yes
1  ravi   12    cricket     11     yes
2  navi   10  vollyball     23      no
3  savi   11    cricket     41     yes

In [43]:
#convert a given list of lists into a Dataframe.
l=[[2,3],[4,1]]
df1=pd.DataFrame(l,columns=['col1','col2'])
df1

   col1  col2
0     2     3
1     4     1

In [49]:
#get column index from column name of a given DataFrame.
df.columns.get_loc('score')

3

In [52]:
#group by the first column and get second column as lists in rows.
df2=pd.DataFrame({'col1':['a','a','b','c','b','a'],'col2':[1,1,2,3,2,1]})
df2.groupby(by=['col1'])['col2'].apply(list)

col1
a    [1, 1, 1]
b       [2, 2]
c          [3]
Name: col2, dtype: object

In [54]:
#count number of columns of a DataFrame.
len(list(df.columns.values))

5

In [58]:
#select all columns, except one given column in a DataFrame.
df.loc[:,df.columns!='sports']

   name  age  score qualify
0  kavi   10     32     yes
1  ravi   12     11     yes
2  navi   10     23      no
3  savi   11     41     yes